




#Задачи на циклы и оператор условия------
#----------------------------------------

'''
Задача 1
Вывести на экран циклом пять строк из нулей, причем каждая строка должна быть пронумерована.
'''

# a = 0
# b = str(0)
# c = 10
# while a < 6:
#     print(a,b*c)
#     a = a + 1


'''
Задача 2
Пользователь в цикле вводит 10 цифр. Найти количество введеных пользователем цифр 5.
'''

# a=1
# c=0
# while a < 11:
#     b=int(input())
#     if b == 5:
#         c = c + 1
#     a = a + 1
# print (c)


'''
Задача 3
Найти сумму ряда чисел от 1 до 100. Полученный результат вывести на экран.
'''
# sum = 0
#
# for i in range(1,101):
#     sum+=i
# print(sum)

'''
Задача 4
Найти произведение ряда чисел от 1 до 10. Полученный результат вывести на экран.
'''

# pr = 1
#
# for i in range(1,11):
#     pr*=i
# print(pr)

'''
Задача 5
Вывести цифры числа на каждой строчке.
'''
# a = int(input('Введите число: '))
# while a > 0:
#     print(a%10)
#     a = a//10

'''
Задача 6
Найти сумму цифр числа.
# '''
# a=int(input('Введите число: '))
# s = 0
# for i in str(a):
#     s = s + int(i)
# print(s)



'''
Задача 7
Найти произведение цифр числа.
'''

# a=int(input('Введите число: ')) # число 454
# # s = 1
# # for i in str(a):
# #     s = s * int(i)
# # print(s)




'''
Задача 8
Дать ответ на вопрос: есть ли среди цифр числа 5?
# # # '''
# integer_number = int(input('Введите число: '))
# while integer_number>0:
#     if integer_number%10 == 5:
#         print('Yes')
#         break
#     integer_number = integer_number//10
# else: print('No')

'''
Задача 9
Найти максимальную цифру в числе
'''

# a=int(input('Введите число: '))
# for i in max(str(a)):
#     print(i)



'''
Задача 10
Найти количество цифр 5 в числе
'''
#
# integer_number = int(input('Введите число: '))
# a = 0
# while integer_number>0:
#     if integer_number%10 == 5:
#         a = a + 1
#     integer_number = integer_number//10
# print(a)


